# -*- coding: utf-8 -*-
import os
import requests
from getNameList import load1
from downOnePic import getOnePic
from filter_get_list import filter_load
import time


def main(basepath, file, isHaveErr=True):
    #name_list = load1(file)
    m, n = filter_load(file)

    s1 = ['尹晋光', '蓝军', '谭明书', '艾山江·尕依', '王世坤', '黄文辉', '王务新', '陈冬武', '邢志刚', '黄永跃', '张家成', '张勤耘',
          '涂维发', '陈文广', '胡南乾', '吴育标', '古鹏', '莫定伟', '邓小兵', '黄润斌', '马勇', '卢武福', '皮林', '李向阳', '覃道雄',
          '王迪生', '欧爱国', '刘会和', '李霖', '薛伯清', '周建', '肖胜利', '刘强', '刘忠', '梁毅民', '王义芳', '邹家军', '杨雪鸿',
          '杨开凤', '冷永进', '郭成球', '刘学周', '季建业', '许杰', '廖少华', '李达球', '周永康', '陈铁新', '万庆良', '孙兆学',
          '韩先聪', '申维辰', '沈培平', '姚木根', '王帅廷', '孙鸿志', '马建', '令计划', '何家成', '霍克涉', '任润厚', '苏荣',
          '聂春玉', '白云', '梁滨', '奚晓明', '霍克', '郭伯雄', '赵黎平', '廖永远', '张力军', '哲英', '任龚', '刘志庚', '吕锡文',
          '张乐斌', '盖如垠', '司献民', '姚中民', '黄保东', '张智江', '夏兴', '黄兴国', '窦玉沛', '杨东平', '王保安', '郑玉焯',
          '高剑云', '魏健', '张跃明', '吴天君', '陈树隆', '张文雄', '李文科', '曲淑辉', '李云峰', '李嘉', '虞海燕', '孙怀山', '刘君',
          '张化为', '张智江', '许裕良']
    m = s1
    name_list = m

    duplicate_name = dict()

    nums = 50
    for name in name_list[0: nums]:
        if name not in duplicate_name:
            duplicate_name[name] = 0
        else:
            duplicate_name[name] += 1

    name_list = m[50: ]  # max 1870



    for keyword in name_list:
        print '--------%s---------' % nums
        nums += 1
        duplicate_name = getOnePic(keyword, 30, duplicate_name, basepath)


if __name__ =="__main__":
    file1 = os.path.join("json", "中纪委_gamma_0.0.1-resume_conv.json")
    file2 = os.path.join("json", "中纪委_gamma_0.0.1-resume_conv_2.json")
    file3 = os.path.join("json", "zjsjw_aaa-resume_conv.json")
    file4 = os.path.join("json", "zjsjw_aaa-resume_conv_2.json")
    #basepath = "/Users/bin/Desktop/politic/中纪委2/"
    #basepath = '/Users/bin/Desktop/kk/'
    #basepath = "/Users/bin/Desktop/中纪委/a/1800/"
    basepath = "/Users/bin/Desktop/中纪委/invalid/"
    #basepath = "/Users/bin/Desktop/test/"

    print time.strftime('%Y-%m-%d %H:%M:%S', time.localtime(time.time()))

    main(basepath, file1)

    print time.strftime('%Y-%m-%d %H:%M:%S', time.localtime(time.time()))
    print 'well done'

    s1 = ['尹晋光', '蓝军', '谭明书', '艾山江·尕依', '王世坤', '黄文辉', '王务新', '陈冬武', '邢志刚', '黄永跃', '张家成', '张勤耘',
          '涂维发', '陈文广', '胡南乾', '吴育标', '古鹏', '莫定伟', '邓小兵', '黄润斌', '马勇', '卢武福', '皮林', '李向阳', '覃道雄',
          '王迪生', '欧爱国', '刘会和', '李霖', '薛伯清', '周建', '肖胜利', '刘强', '刘忠', '梁毅民', '王义芳', '邹家军', '杨雪鸿',
          '杨开凤', '冷永进', '郭成球', '刘学周', '季建业', '许杰', '廖少华', '李达球', '周永康', '陈铁新', '万庆良', '孙兆学',
          '韩先聪', '申维辰', '沈培平', '姚木根', '王帅廷', '孙鸿志', '马建', '令计划', '何家成', '霍克涉', '任润厚', '苏荣',
          '聂春玉', '白云', '梁滨', '奚晓明', '霍克', '郭伯雄', '赵黎平', '廖永远', '张力军', '哲英', '任龚', '刘志庚', '吕锡文',
          '张乐斌', '盖如垠', '司献民', '姚中民', '黄保东', '张智江', '夏兴', '黄兴国', '窦玉沛', '杨东平', '王保安', '郑玉焯',
          '高剑云', '魏健', '张跃明', '吴天君', '陈树隆', '张文雄', '李文科', '曲淑辉', '李云峰', '李嘉', '虞海燕', '孙怀山', '刘君',
          '张化为', '张智江', '许裕良']
    # duplicate name
    s2 = ['王洪记', '张健', '杨映祥', '张巨彪', '应鹏', '张志勇', '郑良驹', '李路', '于保华', '杨雁文', '郭耀光', '李志新',
          '徐尚红', '解先文', '康晓剑', '李立平', '曲平', '梁柟', '陈长琨', '黄更荣', '王应福', '张光亮', '马秋平', '肖作文',
          '邹太新', '谢国玮', '白文', '孙彦彬', '付延成', '龙福清', '杨丰陌', '陈峻岭', '阎向东', '胡相全', '吴忠厚', '卢志刚',
          '卢勇', '林中校', '黄常青', '黄志强', '李光荣', '熊世平', '卢光辉', '朱信义', '赵耀明', '陈京平', '徐万强', '郭宇',
          '邓晓军', '张桂春', '张书滨', '白建荣', '解根法', '苗俭中', '夏夕云', '张兴斌', '常利民', '黄柏青', '陈达', '温乃粘',
          '张家星', '王政山', '彭博', '梁振林', '曾爱东', '钟世范', '黄斌', '李阳', '杨世芳', '高建国', '徐国才', '彭泽洲',
          '范小雄', '晏拥军', '梁柏雄', '刘志明', '张平', '张国秋', '王詠', '黄峰岩', '董光辉', '谢其华', '刘金海', '严瑞', '蒋颖',
          '刘建超', '张海涛', '王春安', '楼旭逵', '胡守斌', '刘显明', '莫凡', '刘地生', '贾凤鸣', '郭胜伟', '张卫国', '王和平',
          '张文利', '吴学民', '张建津', '马贵中', '杨荣辉', '张建华', '肖万寿', '薛培明', '杨华', '梁英林', '黄宗信', '黄继红',
          '杜迁利', '谭春玉', '张延臣', '林强', '张小普', '宋景春', '吕继臣', '王燕玲', '韦丽坤', '杨雁文', '李进明', '熊伟',
          '刘建军', '贾奋强', '杨有明', '夏先禄', '官汉蒙', '吴树元', '洪钟利', '陆海军', '赵洪兴', '杨文', '蔡勇', '李培中',
          '刘先义', '孙义良', '任津明', '钟世范', '曾爱东', '卢旺存', '崔志勇', '张光合', '徐铁骏', '陈盛仪', '温新才', '李斌',
          '张慎勇', '胡勋璧', '陈家堂', '刘文秀', '沙圣虎', '孙立凯', '张鳞龙', '彭博', '孙纲', '佟景春', '肖玉平', '陈和平',
          '孙晓乐', '杜全顺', '夏鹭平', '郝素珍', '吴永平', '董洪运', '郑新平', '唐成良', '李寿垓', '常利民', '黄峰岩', '徐国才',
          '王建平', '胡铁辉', '欧阳天秋', '梁光', '赵欣', '蔡江华', '黄澍东', '杨步国', '高建国', '黄泽春', '李自成', '李敏',
          '刘万青', '尹喜平', '田志明', '柳遂记', '李锋德', '李跃民', '任光明', '赵新尉', '赵红梅', '张苏洲', '阚相华', '李建新',
          '贺登峰', '王铜芳', '龚亚立', '覃金平', '廖秋文', '肖地楚', '王建根', '李景涛', '李江山', '丁少青', '郝东恒', '潘晓东',
          '张凤国', '侯志宇', '贾朝强', '郜海镭', '刘铁鹰', '李思福', '杨永辉', '杨世芳', '马甄拔', '刘先义', '牟少伦', '刘圣华',
          '付臣', '彭泽英', '王万年', '苏浩志', '韩定海', '袁军晓', '蔡念庚', '王富强', '冯芊', '张洪德', '刘明刚', '毛传强',
          '张喜文', '黄运昌', '毛宗保', '李键', '辛利杰', '韦宁贤', '杨评防', '李竹林', '瓦庆荣', '王庸晋', '杨新华', '肖本明',
          '王修德', '李作良', '臧小军', '许洪元', '王琦', '周艺平', '陈勇', '李义成', '周先雁', '秦斌', '容康社', '陶荣铅',
          '陆健', '覃晓光', '曾义国', '高玉林', '杨继红', '谭石海', '木合塔尔·吐送', '阿巴白克·伊力', '亚力坤·阿布都热扎克',
          '阿不都卡德尔·阿不拉', '艾力·伊明', '尼加提·阿吾东', '张宽民', '杨建勋', '叶铁强', '何国林', '邵广毅', '张华', '马甄拔',
          '张晓波', '许亚林', '薛培明', '孟繁有', '郭治鑫', '贺福宝', '陈兰平', '李会永', '张文强', '阿不都热扎克·沙依',
          '陈优秀', '何国林', '李廷荣', '李连玉', '刘贤平', '董锋', '周连科', '邵广毅', '吴国友', '祝向军', '贺贵元', '王茂建',
          '刘运武', '郑丹竹', '郭治鑫', '金奎祥', '陈延违', '步进来', '黄林邦', '侯经能', '赵建国', '宋德平', '云斌', '陈阳',
          '杨建勋', '李扬达', '王智光', '刘广明', '李辉', '王义兵', '姜凤黎', '窦仁政', '李林', '谢春森', '刘元祥', '叶胜坤',
          '贺福宝', '杨银学', '周舒身', '孟祥久', '田唯', '刘宝龙', '张建华', '任伟', '周和宇', '吴旭勇', '刘洪元', '贾东',
          '王强', ]
